app/views/restaurant_features/_form.html.erb

          <label for="inputEmail">Select R</label>
          <%= f.collection_select(:restaurant_id, Restaurant.all, :id, :name, {},:class=>"form-control") %>
---
SELECT "restaurants".* FROM "restaurants"