app/views/components/_item_select_list.html.erb

SELECT "items".* FROM "items"
---
  <label for="inputEmail">R</label>
  <%= f.collection_select :item_id ,Item.all,:id,:name,{},:class=>"form-control"%>