app/views/components/_r_select_list.html.erb

SELECT "restaurants".* FROM "restaurants"
---
  <label for="inputEmail"><%= n %></label>
  <%= f.collection_select :restaurant_id ,Restaurant.all,:id,:name,{},:class=>"form-control"%>