app/views/item_labels/list_restaurant_item.html.haml

SELECT "item_labels".* FROM "item_labels" WHERE (item_id='1')
SELECT "restaurant_items".* FROM "restaurant_items" WHERE (restaurant_id='1' AND item_label_id=1)
---
          %tbody
            - RestaurantItem.findByItemLabelAndRestaurant(i.id,params[:rid]).each do |ri|