app/views/restaurant_items/_form.html.erb

                <label for="inputEmail">
                  <% ItemLabel.itemLabel(@restaurant_item.item_label_id).each do |i| %>
---
SELECT "item_labels".* FROM "item_labels" WHERE "item_labels"."id" = 1
SELECT "items".* FROM "items"