app/views/home/show.html.haml

SELECT "restaurant_features".* FROM "restaurant_features" WHERE "restaurant_features"."restaurant_id" = $1  [["restaurant_id", 1]]
---
                %ul.list-group
                  - @restaurant.restaurant_features.each do |f|

SELECT "item_labels".* FROM "item_labels" WHERE (id in (2,2,1))
SELECT "items".* FROM "items" WHERE (id in (1,1))
SELECT "restaurant_items".* FROM "restaurant_items" WHERE (restaurant_id=1 AND item_label_id=1)
---
                    %tbody
                      - RestaurantItem.findByItemLabelAndRestaurant(il.id,@restaurant.id).each do |ri|