app/views/restaurants/show.html.erb

              <ul class="list-group">
              <% @restaurant.restaurant_features.each do |f| %>
---
SELECT "restaurant_features".* FROM "restaurant_features" WHERE "restaurant_features"."restaurant_id" = $1  [["restaurant_id", 1]]
SELECT "restaurants".* FROM "restaurants" INNER JOIN "restaurant_items" ON "restaurant_items"."restaurant_id" = "restaurants"."id" WHERE (Restaurants.id = '1')

        <div class="panel-body">
          <% if !@restaurant.restaurant_items.nil? && !@restaurant.restaurant_items.blank? %>
---
SELECT "restaurant_items".* FROM "restaurant_items" WHERE "restaurant_items"."restaurant_id" = $1  [["restaurant_id", 1]]