app/views/restaurants/show.html.haml

SELECT "restaurant_features".* FROM "restaurant_features" WHERE "restaurant_features"."restaurant_id" = $1  [["restaurant_id", 2]]
---
        %ul.list-group
          - @restaurant.restaurant_features.each do |f|

SELECT "restaurant_items".* FROM "restaurant_items" WHERE "restaurant_items"."restaurant_id" = $1  [["restaurant_id", 2]]
---
          .panel-body
            - if !@restaurant.restaurant_items.nil? && !@restaurant.restaurant_items.blank?