app/controllers/home_controller.rb

  def show
    @restaurant = Restaurant.find(params[:id])
    @restaurant_items = RestaurantItem.where("restaurant_id=?",params[:id])
    @item_label_ids = @restaurant_items.map{|ri| ri.item_label_id}
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "items".* FROM "items" WHERE (id in (1,1))
SELECT "restaurant_items".* FROM "restaurant_items" WHERE (restaurant_id=1 AND item_label_id=1)
SELECT "item_labels".* FROM "item_labels" WHERE (id in (2,2,1))