app/controllers/items_controller.rb

INSERT INTO "items" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 01 Sep 2015 09:13:03 UTC +00:00], ["description", "Veg"], ["name", "Veg"], ["updated_at", Tue, 01 Sep 2015 09:13:03 UTC +00:00]]
---
  def create
    @item = Item.new(item_params)
    @item.save