app/controllers/item_labels_controller.rb

  def index
    @item_labels = ItemLabel.all
---
SELECT "item_labels".* FROM "item_labels"

  def create
    @item_label = ItemLabel.new(item_label_params)
    @item_label.save
---
INSERT INTO "item_labels" ("created_at", "item_id", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 04 Sep 2015 05:01:48 UTC +00:00], ["item_id", 1], ["name", "Panner"], ["updated_at", Fri, 04 Sep 2015 05:01:48 UTC +00:00]]

  def list_restaurant_item
    #get_list_by_item_id
    @items_labels = ItemLabel.where("item_id=?",params[:id])
---
SELECT "item_labels".* FROM "item_labels" WHERE (item_id='1')

  def get_item_labels_by_item_id
    @item_labels = ItemLabel.where("item_id = ?",params[:id])
---
SELECT "item_labels".* FROM "item_labels" WHERE (item_id = '2')

    def set_item_label
      @item_label = ItemLabel.find(params[:id])
---
SELECT "item_labels".* FROM "item_labels" WHERE "item_labels"."id" = $1 LIMIT 1  [["id", "1"]]