app/controllers/restaurant_features_controller.rb

  def index
    @restaurant_features = RestaurantFeature.joins(:restaurant)
---
SELECT "restaurant_features".* FROM "restaurant_features" INNER JOIN "restaurants" ON "restaurants"."id" = "restaurant_features"."restaurant_id"

  def create

    @fList = params[:restaurant_feature][:name]
    @fList.each do |f|
      if !f.nil? and !f.blank?
        params[:restaurant_feature][:name] = f.to_s
        @restaurant_feature = RestaurantFeature.new(restaurant_feature_params)
        @restaurant_feature.save
---
INSERT INTO "restaurant_features" ("created_at", "name", "restaurant_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Mon, 31 Aug 2015 05:01:54 UTC +00:00], ["name", "Ac"], ["restaurant_id", 1], ["updated_at", Mon, 31 Aug 2015 05:01:54 UTC +00:00]]

    def set_restaurant_feature
      @restaurant_feature = RestaurantFeature.find(params[:id])
---
SELECT "restaurant_features".* FROM "restaurant_features" WHERE "restaurant_features"."id" = $1 LIMIT 1  [["id", "3"]]