app/controllers/restaurant_items_controller.rb

  def index
    @restaurant_items = RestaurantItem.all
---
SELECT "restaurant_items".* FROM "restaurant_items"

  def create
    @restaurant_item = RestaurantItem.new(restaurant_item_params)
    @restaurant_item.item_label_id = params[:item_label_id]
    @restaurant_item.save
---
INSERT INTO "restaurant_items" ("created_at", "item_label_id", "name", "price", "restaurant_id", "short_description", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @restaurant_item = RestaurantItem.find(params[:id])
    if !params[:item_label_id].nil? && !params[:item_label_id].blank?
      params[:restaurant_item][:item_label_id] = params[:item_label_id]
    end
    puts params[:restaurant_item].to_json
    @restaurant_item.update_attributes(restaurant_item_params)
---
SELECT "restaurant_items".* FROM "restaurant_items" WHERE "restaurant_items"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "restaurant_items" SET "item_label_id" = $1, "updated_at" = $2 WHERE "restaurant_items"."id" = 1  [["item_label_id", 2], ["updated_at", Fri, 04 Sep 2015 13:40:48 UTC +00:00]]

    def set_restaurant_item
      @restaurant_item = RestaurantItem.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 ORDER BY "items"."id" ASC LIMIT 1  [["id", 1]]
SELECT "restaurant_items".* FROM "restaurant_items" WHERE "restaurant_items"."id" = $1 LIMIT 1  [["id", "2"]]