app/controllers/restaurants_controller.rb

  def index
   # @restaurants = Restaurant.all
    @restaurants = Restaurant.search(params)
---
SELECT "restaurants".* FROM "restaurants"

  def create
    @restaurant = Restaurant.new(restaurant_params)
    @restaurant.user_id = current_user.id
    respond_to do |format|
      if @restaurant.save
---
INSERT INTO "restaurants" ("address1", "address2", "city", "contact1", "contact2", "country", "created_at", "description", "email", "feature_list", "image", "latitude", "longitude", "name", "no_of_tables", "state", "updated_at", "user_id", "zip_code") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"

  def update
    respond_to do |format|
      if @restaurant.update(restaurant_params)
---
UPDATE "restaurants" SET "latitude" = $1, "longitude" = $2, "updated_at" = $3 WHERE "restaurants"."id" = 3  [["latitude", ""], ["longitude", ""], ["updated_at", Tue, 08 Sep 2015 11:03:32 UTC +00:00]]